app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("address", "created_at", "description", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", ""], ["created_at", Wed, 30 Oct 2013 18:42:32 UTC +00:00], ["description", "asdf"], ["image", "brice.jpg"], ["name", "asdf"], ["updated_at", Wed, 30 Oct 2013 18:42:32 UTC +00:00]]

  def update
    @restaurant = Restaurant.find(params[:id])
    if @restaurant.update(restaurant_params)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "restaurants" SET "address" = ?, "updated_at" = ? WHERE "restaurants"."id" = 2  [["address", "10849 63rd ave forest hills, ny 11375"], ["updated_at", Wed, 30 Oct 2013 20:38:28 UTC +00:00]]